scottc385/mm-iot-esp32/examples/transfer_reset/sdkconfig.defaults
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_DHCP6=y

CONFIG_FREERTOS_HZ=1000

CONFIG_IDF_TARGET="esp32s3"

CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_TCP_MSS=1460
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8760
CONFIG_LWIP_TCP_WND_DEFAULT=14600
CONFIG_LWIP_TCP_RECVMBOX_SIZE=10
CONFIG_LWIP_UDP_RECVMBOX_SIZE=10

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_MBEDTLS_NIST_KW_C=y
CONFIG_MM_RESET_N=3
CONFIG_MM_WAKE=8
CONFIG_MM_BUSY=9
CONFIG_MM_SPI_SCK=12
CONFIG_MM_SPI_MOSI=11
CONFIG_MM_SPI_MISO=13
CONFIG_MM_SPI_CS=10
CONFIG_MM_SPI_IRQ=14
